# 1. Берем базу. Slim — это облегченная версия Linux, но не такая капризная, как Alpine
FROM python:3.11-slim

# 2. Говорим Питону: "Не пиши .pyc файлы" и "Выводи логи сразу, не буферизируй"
# Это важно, чтобы ты видел принты в реальном времени
ENV PYTHONDONTWRITEBYTECODE=1
ENV PYTHONUNBUFFERED=1

# 3. Создаем рабочую папку внутри контейнера
WORKDIR /app

# 4. СНАЧАЛА копируем зависимости (чтобы кэшировать этот слой)
COPY requirements.txt .

# 5. Устанавливаем библиотеки
RUN pip install --no-cache-dir -r requirements.txt

# 6. И только ТЕПЕРЬ копируем весь остальной код
COPY . .

# 7. Запускаем бота
CMD ["python", "main.py"]

# САМЫЙ БАЗОВЫЙ ДОКЕР ФАЙЛ