LEXICON = {
    '/start': 'Приветствую! Я бот показывающий погоду в твоём городе\n\n'
              'Я помогу тебе всегда быть в курсе погоды.\n'
              'Напиши название города и я пришлю сводку.\n',

    '/help': '📖Справка:\n\n'
             'Инструкция по использованию:\n'
             '\n\n'
             '1. Введи название своего города на русском. \n'
             '2. Я пришлю тебе температуру.\n'
             '3. Данные обновляются каждые несколько минут \n\n'
             'Если при использовании бота произошли проблемы, нажмите команду /start',
             
    'pogoda_button': '🏙️Выбрать город🏙️',
    'help_button': '📖Помощь📖'
}

